Repository: hasswillz/proposal-generator
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: sw

source: Project Name
sw: Jina la Mradi

source: Agriculture
sw: Kilimo

source: Livestock
sw: Ufugaji

source: Fishing
sw: Uvuvi

source: Transportation
sw: Usafirishaji

source: Food and Beverage
sw: Chakula na Vinywaji

source: Culture and Arts
sw: Sanaa na Utamaduni

source: Other Business
sw: Biashara

source: Brief Description
sw: Maelezo Mafupi

source: Estimated Budget (Tsh)
sw: Makadirio ya Bajeti (TSh)

source: Estimated Duration (weeks)
sw: Muda wa Mradi (Wiki)

source: Writing Style
sw: Aina ya Aundishi

source: Professional
sw: Kitaalam

source: Concise
sw: Fupi

source: Detailed
sw: Kina

source: Creative
sw: Bunifu

source: Complexity Level
sw: Kiwango

source: Low
sw: Chini

source: Medium
sw: Kati

source: High
sw: Juu

source: Target Audience
sw: Jamii Nufaika

source: Contact Email for Proposal
sw: Baruapepe Binafsi

source: Contact Mobile Number
sw: Namba ya Simu

source: Generate Proposal
sw: Tengeneza Pendekezo

source: Email
sw: Baruapepe

source: Password
sw: Nywila

source: Password must be at least 8 characters
sw: Nywila lazima iwe na herufi 8

source: Remember Me
sw: Nikumbuke

source: Username
sw: Jina la Mtumiaji

source: Passwords must match
sw: Nywila hazifanani

source: Register
sw: Sajili

source: Username already taken. Please choose a different one.
sw: Jina la mtumiaji limeshatumika. Tafadhali jaribu lingine

source: Email already registered. Please use a different one.
sw: Baruapepe imeshatumika, Tafadhali tumia nyingine

source: Request Password Reset
sw: Omba Kubadili Nywila

source: Repeat Password
sw: Rudia Password

source: Reset Password
sw: Badili Nywila

source: Current Password
sw: Nywila ya Sasa

source: New Password
sw: Nywila Mpya

source: Confirm New Password
sw: Thibitisha Nywila Mpya

source: Change Password
sw: Badili Nywila

source: Current password is incorrect
sw: Nywila ya sasa si sahihi

source: Your password has been updated successfully!
sw: Nywila yako imebadilishwa kwa mafanikio!

source: Password must be at least 8 characters long
sw: Nywila lazima iwe na herufi angalau 8

source: Login
sw: Ingia

source: Please enter a valid email address.
sw: Tafadhali weka Baruapepe sahihi

source: Please enter your password.
sw: Tafadhali weka Nywila

source: Register Here
sw: Sajili Hapa

source: Forgot Password?
sw: Umesahau Nywila

source: Already have an account?
sw: Je una akaunti

source: Login Here
sw: Ingia Hapa

source: Reset Your Password
sw: Badili Nywila

source: Internal Server Error
sw: Kuna tatizo kwenye Seva

source: Something went wrong on our end. We're working to fix it.
sw: Kuna tatizo, Tafadhali tunalifanyia kazi

source: Go Home
sw: Rudi Nyuma

source: Our Mission
sw: Dhamira Yetu

source: Home
sw: Nyumbani

source: Dashboard
sw: Dashibodi

source: About
sw: Kuhusu Sisi

source: Logout
sw: Toka

source: Your Dashboard
sw: Dashbodi Yako

source: Total Proposals Generated
sw: Jumla ya Mapendekezo

source: Your Recent Proposals
sw: Mapendekezo Yako

source: Download
sw: Pakua

source: Start generating one now!
sw: Anza Kutengeneza Pendekezo

source: Generate a New AI Project Proposal
sw: Tengeneza Pendekezo la Mradi kwa AM

source: Please select a project type
sw: Tafadhali Chagua Aina ya Mradi

source: Please provide a description (at least 20 characters)
sw: Tafadhali toa maelezo mafupi ya Mradi

source: Please enter a valid budget
sw: Tafadhali weka bujeti

source: weeks
sw: Wiki

source: Please enter a valid duration in weeks.
sw: Tafadhali weka muda kwa wiki

source: Please select a writing style.
sw: Tafadhali chagua aina ya Uandishi

source: Please select a complexity level.
sw: Tafadhali weka Kiwango

source: Please specify the target audience.
sw: Tafadhali bainisha jamii lengwa

source: Please enter a valid contact email.
sw: Tafadhali weka baruapepe

source: Back to Dashboard
sw: Rudi kwenye Dashibodi

source: Generated Proposal
sw: Pendekezo Kamilifu

source: Generate Another Proposal
sw: Tengeneza Pendekezo lingine

source: Print Proposal
sw: Printi Pendekezo
